#boolen არის ერთ ერთი ყველაზე მარტივი მონაცემთა ტიპი რომელშიც შედის true and false(true - 1 / false - 0) ეს ეხმარება პროგრამას  გადაწყვეტილებების მისაღებად
age = 10
print(age < 12)

score = (age >= 12)

#-------------------------------------------------------------------------------------------------------------------------------------------------------------
score = 50

score2 = (score >= 50)

print(score2)

#-------------------------------------------------------------------------------------------------------------------------------------------------------------

knows_coding = True
knows_english = False


func1 = knows_coding and knows_english

print(func1)

#-------------------------------------------------------------------------------------------------------------------------------------------------------------

is_sunny = False
is_cloudy = True

weather = is_sunny or is_cloudy

print(weather)

#-------------------------------------------------------------------------------------------------------------------------------------------------------------
secret_number = 7
player_guess = 9


guess = (secret_number == player_guess)

print(guess)