num1 = int(input("ჩაწერე რიცხვი: "))

if num1 > 0 and num1 > 15:
    print("true") 
else:
    print("false")

# Sequencing: კოდის შესრულება ნაბიჯ-ნაბიჯ
#selection ანუ არჩევანს მაგალითად ეს კოდი ორ იყენებს if ნაწილაკს და ამის მაგალთად შეგვვიძლია დავასახელოთ თუ მზე = true წადო გარეთ თუ არა არა
sun = True

if sun:
    print("წადო გარეთ")
else:
    print("არ წხვიდე გარეთ")

#Iteration ანუ ციკლი კოდის ერთი და იმავე მონაკვეთის რამოდენიმეჯერ კითხულობს ამისთვის იყენებს for და while
for num1 in [1, 2, 3]:
    print(num1)

#for loop არის ავტომატური გამეორება და იგი გვეხმარება იმაში რომ გადაურაოთ რამოდენიმეჯერ სიტყვებს ან რიცხვების სიას

#range() გადაეცემა სამი პირობა საიდან სადამდე გინდა სად ჩერდება და რამდენ რიცხვს გინდა რომ გადახტეს გადასვლის დროს

for i in range(10):
    print("Audi")

for i in range(100):
    print("ბიძინაშვილი")

for i in range(46):
    print("იასამნისფერი")

for i in range(32):
    print("ო")