#list არის სიის სტრუქტურა რომელშიც შეგვიძლია შევინახთ ორი ან მეტი ცვლადი სტრინგი ინტეჯერი ან ნებისმიერი ტიპის ინფორმაცის ტიპი

#INDEX-ი  არის სისაში არსებული ცვლადების ან სხვა მონაცემების ტიპების რიგითი ნომრები

names = ["გიორგი", "ნიკო", "ანა", "მარიამი", "დავითი", "ლუკა", "სოფო"]

names[1] = "ალექსანდრე"
names[5] = "ელენე"

items = ["წიგნი", "კალამი", "ხე", "სპილო", "კომპიუტერი", "კატა", "ტელეფონი"]

print(items[1])
print(items[3])
print(items[5])

#ცვლადი ინახავს ერთ ინფორმაციას და მხოლოდ ერთს
#ხოლო
#list ინახავს მრავალ ინფორმაციას და გამოაქვს ცალცალკე