name = input("ჩაწრე შნი სახელი: ")
last_name =  input("ჩაწერ შენი გვარი: ")
age = input("ჩაწერე შენი ასაკი: ")
city = input("სად ცხოვრობ ქალაქი ჩაწერე: ")

print(f"ამ კაცის სახელია {name} ამ კაცის გვარია {last_name} და ის არის {age} ხოლო ის ცხოვრობს {city}")

x = 25 
y = 4

print(x * y)
print(x + y)
print(x - y)
print(x / y)
print(x // y)
print(x ** y)
print(x % y)


status = "user"
status = "admin"

color = input("ჩაწერე შენი საყვარელი ფერი")
print(f"შენი საყვარელი ფერია {color}")

#sanke_case ---> არის გამოტოების ფორმა რომელიც იყენებს '_' იმისთვის რომ ცვლადში გამოყოს ორი სიტყვა
#case_sensitive ----> ეს არის ისეთი კოდის ენა რომელიც ყურადღებას აქცევ იმას თუ რითი იწყება ან რა ზომათა განლაგება
#მაგალითად თუ ცვლადი დასაწყისში დავწერეთ დიდი ასოთი მაგრამ პრინტის დოს ცვლადი დავწერეთ პატარა ასოთი ამ ხვლადებს კოდი ორ სხვადასხა
#ცვლადად აღიქვამს და ეს იქნება ერრორი