#კოდის წერა უშვალოდ 2 ნაწილისგან შედგება პირველი არის უშვალოდ კოდის წერა ხოლო მეორე არის დებაგინგი დებაგინგი კოდის სინტაქსური შეცდომების გასწორებაა

#მათემატიკის სავარჯიშოები 
num1 = 10
num2 = 5
num3 = 3

print(num1 + num2 / num3)
print(num1 + num2 * num3)
print(num1 / num2 * num3)
print(num1 + num2 + num3)
print(num1 - num2 - num3)
print(num1 * num2 * num3)
print(num1 // num2 * num3)

# /-ნიშნავს გაყოფას ხოლო //-ნიშნავს თუ რამდენჯერ მოთავსდება ერთ რიცხვში მეორე
#case_sensitive ნიშნავს იმას რომ ცვლადის შექმის დროს მნიშვნელობა აქვს იმას თუ დიდი ასოთი იწყება თუ არა ცვლადი 
#მაგალითად თუ ჩვენ შევქმნით ორ მსგავს ცვლადს და ერთს დავიწყებთ დიდი ასოთი ხოლო მეორე პატარათი ეს ცვლადები სხვადასხვა იქნება ერთმანეთისგან
#case_insensitive არის case_sensitive-ის საპირისპირო ამ შემთხვევაში მნიშვნელობა არ აქვს ჩვენ ცვლადს დიდი ასოთი დავიწყებთ თუ პატარათი 
#ამ შემთხვევაში იგი ყურადღებას სახლეს ამახვილებს და მისთვის num1 და Num1 ერთი და იგივეა და არა განსხვავებული

#snake_case არის წერის მეთოდი როდესაც ჩვენ ორ სიტყვას ცვლადში სპეისის მაგივრად "_" ვყოფთ
