#str() ------> მხოლოდ გვაძევს იმის უფლებას რომ ჩავწეროთ ტექსტი ან სხვა ტიპის ფორემბი((int float) გადაკეთოს ტექსტის ფორმებად
#int() ------>მხოლოდ გვაძლევს რიცხვების ჩაწერის უფლებას ან ცვლის სტრინგიან რიცხვებს რიცხვებათ
#float() ------>მხოლოდ გვაძევს იმის უფლებას რომ ჩავწეროთ ათწილადი რიცხვები ან ცვლის რიცხვს ათწილადის ფორმაში 

#მონაცემთა ტიპები არის სხვადასხვა ფორმის მონაცემები მაგალითად str() ---> ტექსტი , int() ---> რიცხვი , float() ---> ათწილადები

print("10" + "20")

#ამის შედეგი იქნება 1020 იმიტომ რომ სტრინგების შეკრება შეუძლებელია და პიტონი ამათ როგორც ტექსტად ისე მიღებს და უბრალოდ ერთმანეთშ გადაბავს

num1 = int(input("ჩაწერე შენი რაიმე რივხვი"))
num2 = int(input("ჩაწერე შენი რაიმე რივხვი"))


print(num1 - num2)
print(num1 * num2)
print(num1 / num2)
print(num1 + num2)
print(num1 // num2)
